# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: 
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512] 
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.50, 512] 

# YOLO26n backbone (索引已重新标注)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, ES_MOE, [256]]          # 3
  - [-1, 1, Conv, [256, 3, 2]]      # 4 - P3/8 (下采样)
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, ES_MOE, [512]]          # 6 - <- P3 最终特征，传给 Head
  - [-1, 1, Conv, [512, 3, 2]]      # 7 - P4/16 (下采样)
  - [-1, 2, C3k2, [512, True]]      # 8
  - [-1, 1, ES_MOE, [512]]          # 9 - <- P4 最终特征，传给 Head
  - [-1, 1, Conv, [1024, 3, 2]]     # 10 - P5/32 (下采样)
  - [-1, 2, C3k2, [1024, True]]     # 11
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 12
  - [-1, 2, C2PSA, [1024]]          # 13
  - [-1, 1, ES_MOE, [1024]]         # 14 - <- P5 最终特征，传给 Head

# YOLO26n head (索引已修正)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 9], 1, Concat, [1]]       # 16 - cat backbone P4 (第9层)
  - [-1, 2, C3k2, [512, True]]      # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 6], 1, Concat, [1]]       # 19 - cat backbone P3 (第6层)
  - [-1, 2, C3k2, [256, True]]      # 20 (P3/8-small 输出)

  - [-1, 1, Conv, [256, 3, 2]]      # 21
  - [[-1, 17], 1, Concat, [1]]      # 22 - cat head P4 (第17层)
  - [-1, 2, C3k2, [512, True]]      # 23 (P4/16-medium 输出)

  - [-1, 1, Conv, [512, 3, 2]]      # 24
  - [[-1, 14], 1, Concat, [1]]      # 25 - cat head P5 (第14层)
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 26 (P5/32-large 输出)

  - [[20, 23, 26], 1, Segment26, [nc, 32, 256]] # 27 - Segment26(P3, P4, P5)