# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: 
  m: [0.50, 1.00, 512] 

# YOLO26n backbone (索引已重新标注)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1 - P2/4 (保留普通Conv以便前期快速降维)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, ES_MOE, [256]]          # 3 - <- P2 最终特征，传给 Head (高频细节最丰富)
  
  # 使用 DWTDown 替代 Conv 进行下采样，保留高频边缘信息
  - [-1, 1, DWTDown, [256]]         # 4 - P3/8 (频域下采样)
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, ES_MOE, [512]]          # 6 - <- P3 最终特征，传给 Head
  
  - [-1, 1, DWTDown, [512]]         # 7 - P4/16 (频域下采样)
  - [-1, 2, C3k2, [512, True]]      # 8
  - [-1, 1, ES_MOE, [512]]          # 9 - <- P4 最终特征，传给 Head
  
  - [-1, 1, DWTDown, [1024]]        # 10 - P5/32 (频域下采样)
  - [-1, 2, C3k2, [1024, True]]     # 11
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 12
  - [-1, 2, C2PSA, [1024]]          # 13
  - [-1, 1, ES_MOE, [1024]]         # 14 - <- P5 最终特征，传给 Head

# YOLO26n head (引入 P2 分支，构建 4 尺度分割头)
head:
  # 第一阶段：Top-down 特征融合 (P5 -> P4 -> P3 -> P2)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 9], 1, Concat, [1]]       # 16 - cat backbone P4 (第9层)
  - [-1, 2, C3k2, [512, True]]      # 17 (P4 intermediate)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 6], 1, Concat, [1]]       # 19 - cat backbone P3 (第6层)
  - [-1, 2, C3k2, [256, True]]      # 20 (P3 intermediate)

  # 继续上采样至 P2，提取极致边界信息
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 21
  - [[-1, 3], 1, Concat, [1]]       # 22 - cat backbone P2 (第3层)
  - [-1, 2, C3k2, [128, True]]      # 23 (P2/4-tiny 输出)

  # 第二阶段：Bottom-up 特征融合 (同样采用 DWT 避免下采样丢失边缘)
  - [-1, 1, DWTDown, [256]]         # 24 - down P2 -> P3
  - [[-1, 20], 1, Concat, [1]]      # 25 - cat P3 intermediate (第20层)
  - [-1, 2, C3k2, [256, True]]      # 26 (P3/8-small 输出)

  - [-1, 1, DWTDown, [512]]         # 27 - down P3 -> P4
  - [[-1, 17], 1, Concat, [1]]      # 28 - cat P4 intermediate (第17层)
  - [-1, 2, C3k2, [512, True]]      # 29 (P4/16-medium 输出)

  - [-1, 1, DWTDown, [1024]]        # 30 - down P4 -> P5
  - [[-1, 14], 1, Concat, [1]]      # 31 - cat backbone P5 (第14层)
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 32 (P5/32-large 输出)

  # 最终分割头接收 4 个尺度：P2, P3, P4, P5
  - [[26, 29, 32], 1, Segment26, [nc, 32, 256]] # 33