# Parameters
nc: 4 # number of classes
end2end: True # YOLO26 核心：端到端模式
reg_max: 1 # YOLO26 核心：剥离 DFL
scales: # 使用 YOLO26 的动态缩放系数
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Mamba-YOLO26 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4: 🌟 真正的 P3 特征层
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 2, C3k2, [512, True]]           # 6: 🌟 真正的 P4 特征层
  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]    # 9
  - [-1, 2, C2PSA, [1024]]               # 10: 🌟 真正的 P5 最终输出层

# Mamba-YOLO26 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]            # 12: 【修复】拼接第 6 层 (C3k2 P4)，而不是第 5 层
  - [-1, 2, VSSBlock, [512]]             # 13: Top-down P4 融合 (来自 Mamba-YOLO)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]]            # 15: 【修复】拼接第 4 层 (C3k2 P3)，而不是第 3 层
  - [-1, 2, VSSBlock, [256]]             # 16: 🌟 最终检测头输入 1 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]           # 17: Neck 底部下采样
  - [[-1, 13], 1, Concat, [1]]           # 18: 【修复】拼接第 13 层 (XSSBlock P4)，而不是 12 层
  - [-1, 2, VSSBlock, [512]]             # 19: 🌟 最终检测头输入 2 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]           # 20: Neck 底部下采样
  - [[-1, 10], 1, Concat, [1]]           # 21: 【修复】拼接第 10 层 (C2PSA P5)，而不是 9 层
  - [-1, 1, VSSBlock, [1024]]            # 22: 🌟 最终检测头输入 3 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]      # 23: 【修复】对齐真正的输出层 [16, 19, 22]